#include <stdio.h>
#include <math.h>
#include <stdlib.h>
#include "main.h"

// Калкулатор за бъдеща стойност
void futureValue() {
  // Деклариране на променливи
  float futureValue; // бъдеща стойност
  float presentValue; // сегашна стойност
  float interestRate; // лихвен процент
  float periods; // брой периоди
  float multiplier; // за по-лесно пресмятане

  // Избор на операцията
  printf("\nВие сте избрали опцията за калкулиране на бъдеща стойност.\n\nБъдещата стойност представлява стойността на текущ актив към бъдещата дата, базирана на предполагаем темп на растеж.\nС помощта на този калкулатор, Вие можете да предположите колко ще струва една инвестиция в бъдещето.");

  // Въвеждане на сегашна стойност
  printf("\n\nВъведете сегашната стойност на текущия актив. Моля използвайте '.' при изписването на непълни числа. Пример: 1000.99.\n Вашият отговор: ");
  scanf("%f", &presentValue);
  
  // Проверка за валидност
  while (presentValue <= 0) {
    printf("\n Моля въведете положително число. \n Вашият отговор: ");
    scanf("%f", &presentValue);
  }

  // Въвеждане на лихвен процент
  printf("\n Въведете лихвен процент. Моля използвайте '.' при изписването на непълни числа. Пример: 1000.99.\n Вашият отговор: ");
  scanf("%f", &interestRate);

  // Проверка за валидност
  while (interestRate <= 0) {
    printf("\n Моля въведете положително число. \n Вашият отговор: ");
    scanf("%f", &interestRate);
  }
  
  // Въвеждане на периоди
  printf("\n Въведете продължителността в периоди. \n Вашият отговор: ");
  scanf("%f", &periods);

  // Проверка за валидност
  while (periods <= 0) {
    printf("\n Моля въведете положително число. \n Вашият отговор: ");
    scanf("%f", &periods);
  }

  multiplier = pow(1 + interestRate * 0.01, periods); 
  futureValue = presentValue * multiplier; // пълна формула

  printf("\nВие въведохте следните стойности:\n Сегашна стойност: %.2f\n Лихвен процент: %.2f%%\n Брой периоди: %.0f\n", presentValue, interestRate, periods);
  printf("\n Бъдещата стойност на текущият Ви актив се предполага да бъде: %.2f", futureValue);

  printf("\n\n Край на програмата.");
}